; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image0 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation7 - direction
	Star6 - direction
	Star2 - direction
	Star8 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
)
(:goal (and
	(have_image Star9 image1)
	(have_image Star10 image0)
	(have_image Star11 image0)
	(have_image Phenomenon12 image0)
	(have_image Planet13 image1)
	(have_image Phenomenon14 image1)
	(have_image Planet15 image0)
))

)

; plan
1. (turn_to satellite0 groundstation7 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
5. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 3 of 7
10. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 3 of 7
11. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 7
12. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
13. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   goals met: 5 of 7
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 5 of 7
15. (take_image satellite0 star11 instrument0 image0)
   added: (have_image star11 image0)
   goals met: 6 of 7
16. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 6 of 7
17. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 7 of 7
